{"categories": "basic python", "sub categories": "numpy", "conversations": {"numpy": ["NumPy is a general-purpose array-processing package. It provides a high-performance multidimensional array object, and tools for working with these arrays.", "A tuple is a sequence of immutable Python objects.", "NumPy is an open source library available in Python that aids in mathematical, scientific, engineering, and data science programming.", "NumPy is a Python extension module that provides efficient operation on arrays of homogeneous data. It allows python to serve as a high-level language for manipulating numerical data, much like IDL, MATLAB."], "install numpy": ["Using Command Prompt, you can simply install it by 'pip install numpy' command", "In Ananconda use 'conda install -c anaconda numpy' command"], "import numpy": ["use command 'import numpy as np'"], "check numpy version": ["use command 'print (np.__version__)'"], "array numpy": ["NumPy’s main object is the homogeneous multidimensional array.It is a table of elements (usually numbers), all of the same type, indexed by a tuple of positive integers. NumPy’s array class is called ndarray. It is also known by the alias array.", "A NumPy array is a multidimensional array of objects all of the same type."], "array create numpy": ["you can create an array from a regular Python list or tuple using the array function.", "Often, the elements of an array are originally unknown, but its size is known. Hence, NumPy offers several functions to create arrays with initial placeholder content. These minimize the necessity of growing arrays, an expensive operation. For example np.zeros, np.ones, np.full, np.empty, etc.", "We can use 'arange' function which returns evenly spaced values within a given interval. step size is specified."], "array indexing numpy": ["NumPy offers many ways to do array indexing. 'Slicing' Just like lists in python, NumPy arrays can be sliced. As arrays can bemultidimensional, you need to specify a slice for each dimension of the array. Integer array indexing: In this method, lists are passed for indexing for each dimension. One to one mapping of corresponding elements is done to construct a new arbitrary array.Boolean array indexing: This method is used when we want to pick elements from array which satisfy some condition."], "basic numpy operation": [" 'Unary Operators' :Many unary operations are provided as a method of ndarray class. This includes sum, min, max, etc. 'Binary operators' : These operations apply on array elementwise and a new array is created. You can use all basic arithmetic operators like +, -, /, , etc. In case of +=, -=, = operators, the exsisting array is modified."], "array numpy sort": ["  There is a simple np.sort method for sorting NumPy arrays"], "array numpy stack": ["Several arrays can be stacked together along different axes.'np.vstack': To stack arrays along vertical axis.'np.hstack': To stack arrays along horizontal axis.'np.column_stack': To stack 1-D arrays as columns into 2-D arrays.'np.concatenate': To stack arrays along specified axis (axis is passed as argument)."], "array numpy split": ["For splitting, we have these functions:'np.hsplit': Split array along horizontal axis.'np.vsplit': Split array along vertical axis.'np.array_split': Split array along specified axis."], "np.one np.zeros numpy": ["You can create a matrix full of zeroes or ones using np.zeros and np.one commands respectively."], "  create matrix numpy one zero": ["For numpy zeros we have command, numpy.zeros(shape, dtype=float, order='C') and for ones we have numpy.ones(shape, dtype=float, order='C')"], "numpy reshape": ["You can use the reshape function of numpy to reshape an array. The syntax is numpy.reshape(a, newShape, order='C')"], "function numpy statistical": ["np.min(),np.max(),np.mean(),np.median(),np.stdt() gives minimum, maximum, mean, median, standard deviation respectively for a numpy array."], "numpy use": ["beacuase it is open-source, it doesn’t cost anything, it uses the general-purpose language (Python)"], "difference numpy scipy": ["NumPy is a basic library for mathematical or numerical calculation. Written in C. So much faster than other python library. Maximum library which was developed for data science statistics and in general for mathematical calculations, are developed on the top of NumPy.SciPy which stands for scientific Python, has been written on the top of NumPy and we can perform many tasks."], "Python array instead list nested numpy use": ["The most important benefits of using mumpy arrays over lists  are :It consumes less memory.It is fast as compared to the python List.It is convenient to use."], "array check method numpy": ["You can use the 'size' method to know if a numpy array is empty or not. The syntax is 'array_name.size'"], "Numpy Python advantage": ["numpy is array oriented computing, efficiently implemented multi-dimensional arrays, designed for scientific computation"]}}