{"categories": "basic python", "sub categories": "machine learning", "conversations": {"learning machine": ["Machine learning is exactly the same way how babies do their day to day activities, the way they walk or sleep etc. It is a common fact that babies cannot walk straight away and they fall and then they get up again and then try. This is the same thing when it comes to machine learning, it is all about how the algorithm is working and at the same time redefining every time to make sure the end result is as perfect as possible.", "Machine learning is the field of study that gives computers the avility to learn without being explicitly programmed.", "The acquisition of knowledge or skills through study or experience by a machine."], "learning machine type": ["There are four types of machine learning,Supervised learning (also called inductive learning) Training data includes desired outputs.  This is spam this is not, learning is supervised,Unsupervised learning Training data does not include desired outputs Example is clustering. It is hard to tell what is good learning and what is not,Semi-supervised learning Training data includes a few desired outputs,Reinforcement learning Rewards from a sequence of actions. AI types like it, it is the most ambitious type of learning."], "application learning machine": ["Sample applications of machine learning are web search, computational biology, finance, space exploration, robotics, business analytics, social networks and many more."], "difference learning machine supervised unsupervised": ["A Supervised learning is a process where it requires training labeled data.  When it comes to Unsupervised learning it doesn’t require data labeling."], "clustering different k knn means": ["KNN stands for K- Nearest Neighbours, it is classified as a supervised algorithm. K-means is an unsupervised cluster algorithm."], "linear regression":["Linear regression is a basic and commonly used type of predictive analysis.  The overall idea of regression is to examine two things: (1) does a set of predictor variables do a good job in predicting an outcome (dependent) variable?  (2) Which variables in particular are significant predictors of the outcome variable, and in what way do they–indicated by the magnitude and sign of the beta estimates–impact the outcome variable?  These regression estimates are used to explain the relationship between one dependent variable and one or more independent variables.  The simplest form of the regression equation with one dependent and one independent variable is defined by the formula y = c + b*x, where y = estimated dependent variable score, c = constant, b = regression coefficient, and x = score on the independent variable."], "logistic regression": ["Logistic regression is the appropriate regression analysis to conduct when the dependent variable is dichotomous (binary).  Like all regression analyses, the logistic regression is a predictive analysis.  Logistic regression is used to describe data and to explain the relationship between one dependent binary variable and one or more nominal, ordinal, interval or ratio-level independent variables."], "deep learning": ["Deep learning is a process where it is considered to be a subset of machine learning process."],"f1 score": ["The F1 score is defined as a measure of a model’s performance."], "data difference learning machine mining": ["Data mining is about working on unstructured data and then extract it to a level where the interesting and unknown patterns are identified.Machine learning is a process or a study whether it closely relates to design, development of the algorithms that provide an ability to the machines to capacity to learn."], "inductive learning machine": ["Inductive machine learning is all about a process of learning by live examples"], "algorithm learn machine popular": ["1.Nearest Neighbour 2.Neural Networks 3.Decision Trees etc 4.Support vector machines"], "algorithm available different learning machine technique type": ["Supervised learning,Unsupervised learning,Semi-supervised learning,Transduction,Learning to learn"], "build learning machine model stage": ["1.Model building 2.Model testing 3.Applying the model"], "difference learning reinforcement supervise unsupervised": ["In supervised learning, we train a model to learn the relationship between input data and output data. We need to have labeled data to be able to do supervised learning.With unsupervised learning, we only have unlabeled data. The model learns a representation of the data. Unsupervised learning is frequently used to initialize the parameters of the model when we have a lot of unlabeled data and a small fraction of labeled data. We first train an unsupervised model and, after that, we use the weights of the model to train a supervised model.In reinforcement learning, the model has some input data and a reward depending on the output of the model. The model learns a policy that maximizes the reward. Reinforcement learning has been applied successfully to strategic games such as Go and even classic Atari video games."], "deductive difference inductive learning": ["Inductive learning is the process of using observations to draw conclusions ,Deductive learning is the process of using conclusions to form observations "], "collinearity multicollinearity": ["Collinearity occurs when two predictor variables (e.g., x1 and x2) in a multiple regression have some correlation.Multicollinearity occurs when more than two predictor variables (e.g., x1, x2, and x3) are inter-correlated."], "artificial deep difference intelligence learning learning machine": ["Artificial intelligence, as the name implies, it means to produce intelligence in artificial ways, in other words, using computers. ML is a sub-topic of AI. As learning is one of the many functionalities of an intelligent system, machine learning is one of the many functionalities in an AI.Deep learning is the specific sub-field in machine learning involving making very large and deep (i.e. many layers of neurons) neural networks to solve specific problems. It is the current “model of choice” for many machine learning applications."], "learning machine supervised what": ["Supervised learning is where you have input variables (x) and an output variable (Y) and you use an algorithm to learn the mapping function from the input to the output.Y = f(X). The goal is to approximate the mapping function so well that when you have new input data (x) that you can predict the output variables (Y) for that data.It is called supervised learning because the process of an algorithm learning from the training dataset can be thought of as a teacher supervising the learning process. "], "classification": ["A classification problem is when the output variable is a category, such as 'red' or 'blue' or 'disease' and 'no disease'.", "Separating into groups having definite values Eg. 0 or 1, cat or dog or orange etc"], "regression": ["A regression problem is when the output variable is a real value, such as 'dollars' or 'weight'.", "Estimating the most probable values or relationship among variables. Eg. estimation of the price of the house based on size."],"cluster": ["A clustering problem is where you want to discover the inherent groupings in the data, such as grouping customers by purchasing behavior"], "learning reinforce": ["The machine is exposed to an environment where it gets trained by trial and error method, here it is trained to make a much specific decision. The machine learns from past experience and tries to capture the best possible knowledge to make accurate decisions based on the feedback received."], "learning unsupervised": ["Unsupervised learning is where you only have input data (X) and no corresponding output variables.The goal for unsupervised learning is to model the underlying structure or distribution in the data in order to learn more about the data.These are called unsupervised learning because unlike supervised learning above there is no correct answers and there is no teacher. Algorithms are left to their own devises to discover and present the interesting structure in the data."] }}